In [1]:
pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.22-cp310-cp310-win_amd64.whl (2.1 MB)
     ---------------------------------------- 2.1/2.1 MB 2.3 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\bhavya galphade\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy) (4.7.1)
Collecting greenlet!=0.4.17
  Downloading greenlet-3.0.0-cp310-cp310-win_amd64.whl (287 kB)
     -------------------------------------- 287.7/287.7 kB 3.0 MB/s eta 0:00:00
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.0.0 sqlalchemy-2.0.22
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     -------------------------------------- 44.8/44.8 kB 276.2 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.2.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [15]:
import sqlalchemy
import pandas as pd

In [18]:
mycon = sqlalchemy.create_engine("mysql+pymysql://root@localhost:3306/stddb")

In [5]:
df = pd.read_sql_table("mytab",mycon)
df

   sid      sna  sag
0    1     Aman   20
1    2   AAYUSH  102
2    3  monitor   30
3    4  sahitya   40
4    6   aaryan   50
5    7      Het   80
6    8   Devang   55

In [7]:
student = {
    'first' : ['yash','manav','poojan','arpit','juzer','ishan','shubham','parth','naughty','kush'],
    'last' : ['patel','shah','patel','shah','doshi','doshi','patel','patel','patel','patel'],
    'email' : ['yash@gmail.com','manav@gmail.com','poojan@gmail.com','arpit@gmail.com','juzer@gmail.com','ishan@gmail.com','shubham@gmail.com','parth@gmail.com','kush@gmail.com','abhishek@gmail.com'],
    'college' : ['changa','svit','changa','iti','svit','nirma','svit','changa','svit','changa'],
    'per' : [90,80,70,20,46,82,67,94,58,91],
    'grade' : ['aa','bb','cc','aa','aa','bb','dd','aa','cc','aa']
}

In [8]:
df = pd.DataFrame(student)

In [9]:
df.to_sql(name = "student", con=mycon, index=False, if_exists="append")

10

In [10]:
df = pd.read_sql_table("mytab",mycon)
df

   sid      sna  sag
0    1     Aman   20
1    2   AAYUSH  102
2    3  monitor   30
3    4  sahitya   40
4    6   aaryan   50
5    7      Het   80
6    8   Devang   55

In [19]:
mycon.execute("insert into mytab values(8,'keval',70)")

AttributeError: 'Engine' object has no attribute 'execute'

In [20]:
id = int(input("enter ID: "))
na = input("Enter name: ")
ag = int(input("Enter Age: "))
q = "insert into mytab values(%s,%s,%s)"
data = (id,na,ag)
mycon.execute(q,data)
df = pd.read_sql_table("mytab",mycon)
df

enter ID:  10
Enter name:  janak
Enter Age:  47

AttributeError: 'Engine' object has no attribute 'execute'